0/div(phi)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      div(phi);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
11040
(
-6348.75
-5218.62
-4134.91
-3273.36
-2602.53
-2075.35
-1650.39
-1297.26
...
)
;

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<scalar> 
230
(
-1.15448e-13
1.38638e-13
8.01106e-16
-6.6452e-14
-5.38924e-14
7.29121e-14
6.75358e-14
-8.58629e-14
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<scalar> 
96
(
3.89623e-15
-3.68262e-15
3.48057e-15
0
-6.21724e-15
5.8751e-15
0
1.049e-14
...
)
;
    }
    walls
    {
        type            extrapolatedCalculated;
        value           nonuniform List<scalar> 
82
(
-6348.75
-5218.62
-4134.91
-3273.36
-2602.53
-2075.35
-1650.39
-1297.26
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
