0/magR
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      magR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
11040
(
0.766965
0.749603
0.745983
0.737844
0.726207
0.713995
0.70293
0.693691
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
230
(
1.34367e-17
1.79921e-17
3.00616e-18
1.25686e-17
1.72942e-18
8.18566e-19
7.24035e-19
1.36471e-17
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
2.20742e-18
2.08643e-18
1.97193e-18
1.86369e-18
1.7612e-18
1.66435e-18
1.57379e-18
1.48664e-18
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
