0/turbulenceProperties:I
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      turbulenceProperties:I;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
11040
(
0.0254621
0.0251555
0.02508
0.0249336
0.0247306
0.0245182
0.0243251
0.0241631
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
230
(
1.06589e-10
1.23339e-10
5.04165e-11
1.03087e-10
3.82376e-11
2.63077e-11
2.4683e-11
1.0742e-10
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
4.31e-11
4.19022e-11
4.07361e-11
3.96024e-11
3.8498e-11
3.74245e-11
3.63922e-11
3.53701e-11
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
