0/turbulenceProperties:L
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      turbulenceProperties:L;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
11040
(
0.000289043
0.000292566
0.000293447
0.00029517
0.000297593
0.000300171
0.000302554
0.000304582
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
230
(
6.42744e-12
9.95872e-12
6.8017e-13
5.8145e-12
2.96737e-13
9.66377e-14
7.98171e-14
6.57884e-12
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
4.24943e-13
3.90489e-13
3.58789e-13
3.29659e-13
3.02841e-13
2.78207e-13
2.55814e-13
2.3486e-13
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
