0/turbulenceProperties:R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "0";
    object      turbulenceProperties:R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
11040
(
(0.526661 -0.00376579 5.28563e-21 0.392406 7.43068e-22 0.396046)
(0.509764 -0.0355569 2.43218e-20 0.380785 3.41922e-21 0.393089)
(0.497602 -0.0540035 1.11517e-19 0.380589 1.56774e-20 0.397747)
(0.483592 -0.0636734 -3.09911e-20 0.378957 -4.35681e-21 0.398541)
(0.469044 -0.068849 -2.11901e-20 0.375398 -2.97896e-21 0.396195)
(0.455552 -0.0717184 -2.6705e-21 0.371229 -3.75426e-22 0.392637)
(0.443823 -0.0734118 -3.38157e-20 0.36737 -4.7539e-21 0.389092)
(0.433974 -0.0745057 -4.69549e-20 0.364241 -6.60104e-21 0.386135)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
230
(
(9.20965e-18 2.94857e-20 8.85656e-25 6.91831e-18 1.24508e-25 6.91831e-18)
(8.24727e-18 -1.7622e-19 -8.87558e-24 1.13057e-17 -1.24775e-24 1.13057e-17)
(2.0605e-18 2.47303e-21 7.78276e-24 1.54779e-18 1.09412e-24 1.54779e-18)
(8.61138e-18 1.02583e-19 8.72879e-24 6.4727e-18 1.22712e-24 6.4727e-18)
(7.94428e-19 3.25679e-20 -4.35122e-24 1.08574e-18 -6.11706e-25 1.08574e-18)
(3.75384e-19 -1.00434e-20 -3.11836e-25 5.14264e-19 -4.38387e-26 5.14264e-19)
(4.11956e-19 -8.68995e-20 -1.82782e-24 4.11956e-19 -2.56959e-25 4.11956e-19)
(9.35116e-18 9.89784e-20 1.33512e-23 7.02781e-18 1.87695e-24 7.02781e-18)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
96
(
(1.27122e-18 -2.62995e-19 -6.11203e-22 1.22572e-18 -8.59245e-23 1.27122e-18)
(1.17287e-18 2.48577e-19 1.4609e-21 1.21587e-18 2.05377e-22 1.17287e-18)
(1.10851e-18 2.34938e-19 -5.83995e-22 1.14915e-18 -8.20995e-23 1.10851e-18)
(1.04766e-18 2.22037e-19 1.74807e-21 1.08607e-18 2.45749e-22 1.04766e-18)
(9.90047e-19 2.09832e-19 4.33769e-22 1.02634e-18 6.09804e-23 9.90047e-19)
(9.35603e-19 1.98285e-19 -1.86134e-21 9.69903e-19 -2.61671e-22 9.35603e-19)
(8.84706e-19 1.87358e-19 7.38005e-21 9.17116e-19 1.03751e-21 8.84706e-19)
(8.35708e-19 1.77019e-19 -5.96813e-21 8.66329e-19 -8.39014e-22 8.35708e-19)
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
