0/turbulenceProperties:devReff
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "0";
    object      turbulenceProperties:devReff;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
11040
(
(0.176581 -0.00753158 1.05713e-20 -0.0919305 1.48614e-21 -0.0846501)
(0.16377 -0.0711137 4.86436e-20 -0.0941881 6.83843e-21 -0.0695816)
(0.144579 -0.108007 2.23035e-19 -0.0894469 3.13548e-20 -0.0551321)
(0.126457 -0.127347 -6.19822e-20 -0.082812 -8.71361e-21 -0.0436448)
(0.110996 -0.137698 -4.23803e-20 -0.0762958 -5.95793e-21 -0.0347004)
(0.0981588 -0.143437 -5.341e-21 -0.0704875 -7.50852e-22 -0.0276713)
(0.0874555 -0.146824 -6.76314e-20 -0.0654502 -9.5078e-21 -0.0220052)
(0.0783813 -0.149011 -9.39098e-20 -0.0610845 -1.32021e-20 -0.0172968)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
230
(
(3.05511e-18 5.89715e-20 1.77131e-24 -1.52756e-18 2.49015e-25 -1.52756e-18)
(-4.07793e-18 -3.5244e-19 -1.77512e-23 2.03896e-18 -2.4955e-24 2.03896e-18)
(6.83611e-19 4.94607e-21 1.55655e-23 -3.41805e-19 2.18824e-24 -3.41805e-19)
(2.85158e-18 2.05165e-19 1.74576e-23 -1.42579e-18 2.45423e-24 -1.42579e-18)
(-3.88413e-19 6.51358e-20 -8.70245e-24 1.94207e-19 -1.22341e-24 1.94207e-19)
(-1.85174e-19 -2.00868e-20 -6.23672e-25 9.25868e-20 -8.76774e-26 9.25868e-20)
(0 -1.73799e-19 -3.65564e-24 0 -5.13919e-25 0)
(3.0978e-18 1.97957e-19 2.67025e-23 -1.5489e-18 3.7539e-24 -1.5489e-18)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
96
(
(3.03289e-20 -5.25991e-19 -1.22241e-21 -6.06579e-20 -1.71849e-22 3.03289e-20)
(-2.86662e-20 4.97153e-19 2.9218e-21 5.73323e-20 4.10754e-22 -2.86662e-20)
(-2.70933e-20 4.69876e-19 -1.16799e-21 5.41867e-20 -1.64199e-22 -2.70933e-20)
(-2.56055e-20 4.44074e-19 3.49615e-21 5.12111e-20 4.91497e-22 -2.56055e-20)
(-2.4198e-20 4.19664e-19 8.67539e-22 4.83961e-20 1.21961e-22 -2.4198e-20)
(-2.28664e-20 3.96569e-19 -3.72267e-21 4.57328e-20 -5.23342e-22 -2.28664e-20)
(-2.16064e-20 3.74717e-19 1.47601e-20 4.32128e-20 2.07501e-21 -2.16064e-20)
(-2.0414e-20 3.54038e-19 -1.19363e-20 4.08281e-20 -1.67803e-21 -2.0414e-20)
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
82
(
(0.179325 -0.00764866 3.23399e-21 -0.0933595 4.54643e-22 -0.0859659)
(0.166089 -0.0721208 2.03978e-20 -0.0955219 2.86758e-21 -0.0705669)
(0.146483 -0.109429 8.8768e-20 -0.0906246 1.24792e-20 -0.055858)
(0.127924 -0.128825 -9.88211e-20 -0.083773 -1.38925e-20 -0.0441512)
(0.112114 -0.139084 -5.78479e-20 -0.0770639 -8.1324e-21 -0.0350498)
(0.0990085 -0.144678 -5.90099e-20 -0.0710977 -8.29577e-21 -0.0279108)
(0.0881038 -0.147912 2.03522e-20 -0.0659355 2.86117e-21 -0.0221684)
(0.0788789 -0.149958 -3.6176e-20 -0.0614723 -5.08571e-21 -0.0174066)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
