0/turbulenceProperties:epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      turbulenceProperties:epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
11040
(
303.123
288.787
285.333
278.73
269.762
260.614
252.5
245.84
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
230
(
9.3088e-32
1.66897e-31
4.65943e-33
8.14441e-32
1.54172e-33
3.45439e-34
2.67693e-34
9.60229e-32
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
2.48857e-33
2.22325e-33
1.98592e-33
1.7739e-33
1.58415e-33
1.41471e-33
1.26495e-33
1.12872e-33
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
