0/turbulenceProperties:k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      turbulenceProperties:k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
11040
(
0.657557
0.641819
0.637969
0.630545
0.620318
0.60971
0.600143
0.592175
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
230
(
1.15231e-17
1.54294e-17
2.57804e-18
1.07784e-17
1.48295e-18
7.01956e-19
6.17935e-19
1.17034e-17
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
1.88408e-18
1.78081e-18
1.68308e-18
1.5907e-18
1.50322e-18
1.42055e-18
1.34326e-18
1.26887e-18
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
